-- Подобрать сервис-образец для курсовой работы.

-- Требования к курсовому проекту:
-- Составить общее текстовое описание БД и решаемых ею задач;
-- минимальное количество таблиц - 10;
-- скрипты создания структуры БД (с первичными ключами, индексами, внешними ключами);
-- создать ERDiagram для БД;
-- скрипты наполнения БД данными;
-- скрипты характерных выборок (включающие группировки, JOIN'ы, вложенные таблицы);
-- представления (минимум 2);
-- хранимые процедуры / триггеры;
-- Примеры: описать модель хранения данных популярного веб-сайта: кинопоиск, booking.com, wikipedia, интернет-магазин, geekbrains, госуслуги...
-- Думайте об этом задании, как о том, чем Вы похвастаетесь на своем следующем собеседовании.

-- так как я работаю в сети обойных магазинов, то решил написать структуру базы данных для интернет магазина, специализирующегося на продаже обоев.
-- Обои имеют множество характеристик, раскрывающих их свойства для применения. Попробую систематизировать эту информацию в виде базы данных,
-- которую можно будет применить для сервиса подбора обоев в интернет магазине.